{
   "data": [
    {
    "imdb_id": "tt1446714",
    "title": "Prometheus",
    "description": "Prometheus (2012) is a science fiction film directed by Ridley Scott that serves as a thematic prequel to his earlier Alien series. The movie follows a group of scientists and explorers aboard the spaceship Prometheus as they set out on an interstellar journey to uncover humanity’s origins. Driven by a series of cryptic star maps discovered among ancient artifacts on Earth, the crew endeavors to find the mysterious Engineers—ancient, advanced beings who may have played a role in the creation of mankind.\n\nAt the heart of the film is Dr. Elizabeth Shaw, an archaeologist whose personal faith and scientific curiosity propel her into deeply existential questions about creation, belief, and the nature of existence. Alongside her, fellow scientist Charlie Holloway and the enigmatic android David add layers of complexity to the narrative. As the crew reaches the distant moon LV-223, they encounter monumental alien structures and unsettling biological remnants, evidence of a civilization long extinct yet powerful enough to have engineered life on Earth. \n\nThe film weaves together themes of creation, faith, and the limitations of human understanding, juxtaposing the scientific quest for knowledge with spiritual wonder and horror. The mood is often one of ominous foreboding, as the explorers come face-to-face with both the beauty and the danger of their discoveries. The narrative gradually builds tension as the implications of their findings become apparent: the Engineers, whose intentions seem both grand and terrifying, may have orchestrated human creation, but their apparent abandonment—or perhaps even hostility—throws into question the future of the human race.\n\nAs events spiral into chaos, ethical and existential dilemmas surface: What does it mean to be human? Can mankind control or even understand the forces that brought it into existence? The film’s rich visual style, intense suspense, and atmospheric tension contribute to an experience that is as intellectually provocative as it is viscerally thrilling. \n\nOverall, Prometheus challenges viewers to contemplate the origins of humanity and the fine line between creator and creation, all while delivering a narrative that is both an adventure into the unknown and a philosophical inquiry into the nature of life itself.",
    "release_year": 2012,
    "release_date": "2012-05-30",
    "runtime": 124,
    "imdb_rating": 6.6,
    "media_type": "Movie",
    "languages_spoken": "Scottish Gaelic,English",
    "cover_image_url": "https://reelrecs.s3.us-east-1.amazonaws.com/static/movies/posters/vertical/compressed/tt1446714.jpg",
    "horizontal_poster_url": "https://reelrecs.s3.us-east-1.amazonaws.com/static/movies/posters/horizontal/compressed/tt1446714.jpg",
    "trailer_url": "https://reelrecs.s3.us-east-1.amazonaws.com/static/movies/trailers/compressed_h265/tt1446714/tt1446714.m3u8",
    "iva_id": null,
    "genres": [
        "Adventure",
        "Mystery",
        "Science Fiction"
    ],
    "subgenres": [
        "Alien Adventure",
        "Scientific Discovery",
        "Space Adventure",
        "Survival Quest"
    ],
    "has_rated": true,
    "n_comments": 2,
    "is_bookmarked": false,
    "has_commented": true,
    "rec_score": 8.9,
    "friends_rec_score": 8,
    "matching_movies": [
        "tt2316204",
        "tt0103644",
        "tt0758730",
        "tt0118583",
        "tt0370263",
        "tt0090605",
        "tt0078748",
        "tt11078434",
        "tt30365813",
        "tt1976009",
        "tt3829266",
        "tt0098321",
        "tt13167288",
        "tt18412256",
        "tt0114367",
        "tt10443844",
        "tt14153236",
        "tt0196381",
        "tt8633296",
        "tt3272066"
    ]
},
        {
    "imdb_id": "tt19770764",
    "title": "Sago Mini Friends",
    "description": "Sago Mini Friends is an animated preschool television series set in the cheerful world of Sagoville. Centered around a spirited character named Harvey, the show follows him and his closest friends as they embark on a series of playful adventures. Each episode is built around the simple yet powerful idea of finding joy in everyday moments—be it through imaginative play, creative exploration, or expressing heartfelt gratitude for the little things in life.\n\nHarvey’s journey is all about discovery; he’s constantly on the lookout for silly fun and unexpected surprises, inviting his friends (and young viewers) to engage with his world of creative play. Along the way, the characters encounter various themes that are relatable for preschoolers: the importance of friendship, working together, and appreciating both big and small blessings. The narrative usually unfolds through light, episodic adventures where creative problem-solving and imaginative scenarios are at the forefront.\n\nA notable characteristic of the show is its musical element—each episode features catchy, memorable songs that not only add to the fun but also reinforce messages of thankfulness and joy. The music complements the playful actions on screen and helps to cement the show's overall themes. The mood throughout Sagoville is warm, inviting, and filled with a sense of wonder, making it an ideal viewing experience for young children embarking on their own imaginative journeys.\n\nIn essence, Sago Mini Friends uses its engaging, vibrant world and endearing characters to create an environment where learning about gratitude, friendship, and creativity becomes a delightful and interactive adventure for its audience.",
    "release_year": 2022,
    "release_date": "2022-09-15",
    "runtime": 0,
    "imdb_rating": 6,
    "media_type": "TV Series",
    "languages_spoken": "English",
    "cover_image_url": "https://reelrecs.s3.us-east-1.amazonaws.com/static/movies/posters/vertical/compressed/tt19770764.jpg",
    "horizontal_poster_url": "https://reelrecs.s3.us-east-1.amazonaws.com/static/movies/posters/horizontal/compressed/tt19770764.jpg",
    "trailer_url": "https://reelrecs.s3.us-east-1.amazonaws.com/static/movies/trailers/compressed_h265/tt19770764/tt19770764.m3u8",
    "iva_id": null,
    "genres": [
        "Animation",
        "Kids"
    ],
    "subgenres": [
        "Animal Adventure",
        "Childhood Adventure",
        "Musical Animation"
    ],
    "has_rated": true,
    "n_comments": 0,
    "is_bookmarked": false,
    "has_commented": false,
    "rec_score": 10,
    "friends_rec_score": -1,
    "matching_movies": [
        "tt0000008",
        "tt0000417",
        "tt0000439",
        "tt0002983",
        "tt0003637",
        "tt0004150",
        "tt0004972",
        "tt0005077",
        "tt0005812",
        "tt0006206",
        "tt0006414",
        "tt0006548",
        "tt0006684",
        "tt0006689",
        "tt0006864",
        "tt0007145",
        "tt0007162",
        "tt0007264",
        "tt0007507",
        "tt0000007"
    ]
},
{
    "imdb_id": "tt0409459",
    "title": "Watchmen",
    "description": "Watchmen, the 2009 film directed by Zack Snyder and adapted from the seminal graphic novel by Alan Moore and Dave Gibbons, reimagines the superhero mythos in a dark, alternative version of 1985. In this grim landscape, the traditional, flamboyant era of masked heroes is over, replaced by a society deeply suspicious of vigilantes and increasingly controlled by governmental oversight. The narrative is set in the midst of Cold War tensions, where the threat of nuclear annihilation looms large and the consequences of unchecked power reveal themselves in morally gray ways.\n\nThe plot is ignited by the brutal murder of one of the costumed veterans, an event that forces the reclusive and uncompromising vigilante Rorschach to resume his role as a detective. Rorschach’s black-and-white view on justice pulls him back into a world he thought was behind him, as he begins to unravel clues that suggest the killing is part of a larger, far more insidious conspiracy. As he reconnects with his former allies—each marked by internal struggles and personal demons—the film delves into themes of identity, legacy, and the price of heroism when the lines between right and wrong become blurred.\n\nKey characters include Dr. Manhattan, a superhuman being whose detached, almost clinical perception of time and humanity challenges traditional ideas of morality and fate; Silk Spectre, who grapples with her legacy and the expectations imposed by her lineage; and Nite Owl, a retired hero whose longing for the past and desire for relevance offer a poignant commentary on obsolescence in a changed world. Additionally, the presence of Ozymandias, whose enigmatic persona and grandiose plans force both the heroes and the audience to question the ethics of sacrificing a few for the perceived greater good, injects a level of philosophical complexity that is central to the film’s narrative.\n\nThe movie’s tone is atmospheric and visually stylized—true to its comic book origins—with a heavy emphasis on the interplay between nostalgia for a lost era of idealistic heroism and the harsh reality of a society on the brink of moral collapse. Themes of power, corruption, and the consequences of absolute authority are interwoven with questions about what it means to be a hero in a world that increasingly rejects such notions.\n\nOverall, Watchmen is not just a superhero film but a deconstruction of the genre, challenging viewers to reconsider the cost of vigilantism, the ethical dilemmas inherent in attempts to control destiny, and the nature of human frailty in the face of overwhelming adversity.",
    "release_year": 2009,
    "release_date": "2009-03-04",
    "runtime": 163,
    "imdb_rating": 7.3,
    "media_type": "Movie",
    "languages_spoken": "English",
    "cover_image_url": "https://reelrecs.s3.us-east-1.amazonaws.com/static/movies/posters/vertical/compressed/tt0409459.jpg",
    "horizontal_poster_url": "https://reelrecs.s3.us-east-1.amazonaws.com/static/movies/posters/horizontal/compressed/tt0409459.jpg",
    "trailer_url": "https://reelrecs.s3.us-east-1.amazonaws.com/static/movies/trailers/compressed_h265/tt0409459/tt0409459.m3u8",
    "iva_id": null,
    "genres": [
        "Action",
        "Mystery",
        "Science Fiction"
    ],
    "subgenres": [
        "Dystopian Society",
        "Political Intrigue",
        "Post-Apocalyptic"
    ],
    "has_rated": true,
    "n_comments": 0,
    "is_bookmarked": false,
    "has_commented": false,
    "rec_score": 9.8,
    "friends_rec_score": -1,
    "matching_movies": [
        "tt0083113",
        "tt0455590",
        "tt9165776",
        "tt9619798",
        "tt1648190",
        "tt4610748",
        "tt0361748",
        "tt2280378",
        "tt0066769",
        "tt1173494",
        "tt0090323",
        "tt0756683",
        "tt0046903",
        "tt0073488",
        "tt0477348",
        "tt0104714",
        "tt0073018",
        "tt5249462",
        "tt0405266",
        "tt0144117"
    ]
}
    ]
}
